#### 📖 Terraform Plan ('infra/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.cms_function_app.data.azurerm_key_vault_secret.services_topics_event_hub_connection_string: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_connectionstring: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.asset_storage_connectionstring_secret: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.jira_token: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_history_event_hub_connection_string: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_publication_event_hub_connection_string: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_key: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.eh_sc_connectionstring: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_lifecycle_event_hub_connection_string: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.serviceid_quality_check_exclusion_list: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.pgres_flex_reviewer_usr_pwd: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_secret: Still reading... [10s elapsed]
module.backoffice.data.azurerm_key_vault_secret.selfcare_api_key: Still reading... [10s elapsed]
module.backoffice.data.azurerm_key_vault_secret.legacy_cosmosdb_key: Still reading... [10s elapsed]
module.backoffice.data.azurerm_key_vault_secret.subscription_migration_api_key: Still reading... [10s elapsed]
module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_secret: Still reading... [10s elapsed]
module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id: Still reading... [10s elapsed]
module.backoffice.data.azurerm_key_vault_secret.bo_auth_session_secret: Still reading... [10s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_topics_event_hub_connection_string: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_connectionstring: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.asset_storage_connectionstring_secret: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.jira_token: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_history_event_hub_connection_string: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_publication_event_hub_connection_string: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_key: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.eh_sc_connectionstring: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_lifecycle_event_hub_connection_string: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.serviceid_quality_check_exclusion_list: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.pgres_flex_reviewer_usr_pwd: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_secret: Still reading... [20s elapsed]
module.backoffice.data.azurerm_key_vault_secret.selfcare_api_key: Still reading... [20s elapsed]
module.backoffice.data.azurerm_key_vault_secret.legacy_cosmosdb_key: Still reading... [20s elapsed]
module.backoffice.data.azurerm_key_vault_secret.subscription_migration_api_key: Still reading... [20s elapsed]
module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_secret: Still reading... [20s elapsed]
module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id: Still reading... [20s elapsed]
module.backoffice.data.azurerm_key_vault_secret.bo_auth_session_secret: Still reading... [20s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_topics_event_hub_connection_string: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_connectionstring: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.asset_storage_connectionstring_secret: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.jira_token: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_history_event_hub_connection_string: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_publication_event_hub_connection_string: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_key: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.eh_sc_connectionstring: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_lifecycle_event_hub_connection_string: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.serviceid_quality_check_exclusion_list: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.pgres_flex_reviewer_usr_pwd: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_secret: Still reading... [30s elapsed]
module.backoffice.data.azurerm_key_vault_secret.selfcare_api_key: Still reading... [30s elapsed]
module.backoffice.data.azurerm_key_vault_secret.legacy_cosmosdb_key: Still reading... [30s elapsed]
module.backoffice.data.azurerm_key_vault_secret.subscription_migration_api_key: Still reading... [30s elapsed]
module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_secret: Still reading... [30s elapsed]
module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id: Still reading... [30s elapsed]
module.backoffice.data.azurerm_key_vault_secret.bo_auth_session_secret: Still reading... [30s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_topics_event_hub_connection_string: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_connectionstring: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.asset_storage_connectionstring_secret: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.jira_token: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_history_event_hub_connection_string: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_publication_event_hub_connection_string: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_key: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.eh_sc_connectionstring: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.services_lifecycle_event_hub_connection_string: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.serviceid_quality_check_exclusion_list: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.pgres_flex_reviewer_usr_pwd: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id: Still reading... [40s elapsed]
module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_secret: Still reading... [40s elapsed]
module.backoffice.data.azurerm_key_vault_secret.selfcare_api_key: Still reading... [40s elapsed]
module.backoffice.data.azurerm_key_vault_secret.legacy_cosmosdb_key: Still reading... [40s elapsed]
module.backoffice.data.azurerm_key_vault_secret.subscription_migration_api_key: Still reading... [40s elapsed]
module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_secret: Still reading... [40s elapsed]
module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id: Still reading... [40s elapsed]
module.backoffice.data.azurerm_key_vault_secret.bo_auth_session_secret: Still reading... [40s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "io-p-itn-svc-rg-01"
      + tags     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
    }

  # module.ai_search.azurerm_role_assignment.admins_group_to_ai_search_reader will be destroyed
  # (because azurerm_role_assignment.admins_group_to_ai_search_reader is not in configuration)
  - resource "azurerm_role_assignment" "admins_group_to_ai_search_reader" {
      - id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01/providers/Microsoft.Authorization/roleAssignments/4e137ff2-89f3-b761-4826-fee6609d0f84" -> null
      - name                                   = "4e137ff2-89f3-b761-4826-fee6609d0f84" -> null
      - principal_id                           = "100cb2bb-92d5-40ad-bfa9-1d3c676f13e1" -> null
      - principal_type                         = "Group" -> null
      - role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/1407120a-92aa-4202-b7e9-c0e197c71c8f" -> null
      - scope                                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01" -> null
        # (4 unchanged attributes hidden)
    }

  # module.ai_search.azurerm_role_assignment.developers_group_to_ai_search_reader must be replaced
-/+ resource "azurerm_role_assignment" "developers_group_to_ai_search_reader" {
      ~ id                                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Search/searchServices/io-p-itn-svc-srch-01/providers/Microsoft.Authorization/roleAssignments/e31775a8-3f3e-3a0f-c504-46aa3735a81e" -> (known after apply)
      ~ name                                   = "e31775a8-3f3e-3a0f-c504-46aa3735a81e" -> (known after apply)
      ~ principal_id                           = "300ea154-9984-4712-85e9-3abcb3e42960" -> "e26fbb5f-cac3-481b-a5d7-7671e86b0892" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/1407120a-92aa-4202-b7e9-c0e197c71c8f" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_key_vault_access_policy.adgroup_services_cms will be created
  + resource "azurerm_key_vault_access_policy" "adgroup_services_cms" {
      + certificate_permissions = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Restore",
          + "Purge",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
        ]
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv"
      + object_id               = "e26fbb5f-cac3-481b-a5d7-7671e86b0892"
      + secret_permissions      = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault.azurerm_key_vault_access_policy.adgroup_svc_admins will be destroyed
  # (because azurerm_key_vault_access_policy.adgroup_svc_admins is not in configuration)
  - resource "azurerm_key_vault_access_policy" "adgroup_svc_admins" {
      - certificate_permissions = [
          - "Get",
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Restore",
          - "Purge",
          - "Recover",
        ] -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv/objectId/100cb2bb-92d5-40ad-bfa9-1d3c676f13e1" -> null
      - key_permissions         = [
          - "Get",
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
        ] -> null
      - key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv" -> null
      - object_id               = "100cb2bb-92d5-40ad-bfa9-1d3c676f13e1" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
          - "Set",
          - "Delete",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
    }

  # module.key_vault.azurerm_key_vault_access_policy.adgroup_svc_developers will be destroyed
  # (because azurerm_key_vault_access_policy.adgroup_svc_developers is not in configuration)
  - resource "azurerm_key_vault_access_policy" "adgroup_svc_developers" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv/objectId/300ea154-9984-4712-85e9-3abcb3e42960" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv" -> null
      - object_id               = "300ea154-9984-4712-85e9-3abcb3e42960" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
          - "Set",
          - "Delete",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
    }

  # module.key_vault.azurerm_key_vault_access_policy.github_action will be created
  + resource "azurerm_key_vault_access_policy" "github_action" {
      + certificate_permissions = []
      + id                      = (known after apply)
      + key_permissions         = []
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv"
      + object_id               = "970922c6-b1c3-4c7d-a207-5db9c9061d95"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + storage_permissions     = []
      + tenant_id               = "7788edaf-0346-4068-9d79-c868aed15b3d"
    }

  # module.key_vault.azurerm_key_vault_access_policy.managed_identity_infra_cd must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_infra_cd" {
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv/objectId/7cfd9f23-0ba4-46de-8256-42407e0338c8" -> (known after apply)
      ~ object_id               = "7cfd9f23-0ba4-46de-8256-42407e0338c8" -> "13becd8f-c214-40ed-8e78-eff499bbd94c" # forces replacement
        # (7 unchanged attributes hidden)
    }

  # module.key_vault.azurerm_key_vault_access_policy.managed_identity_infra_ci must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_infra_ci" {
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-svc-kv/objectId/48d4c47e-d546-4879-a8a8-dfdda79f06b2" -> (known after apply)
      ~ object_id               = "48d4c47e-d546-4879-a8a8-dfdda79f06b2" -> "6dd98eea-3184-4d72-9296-f47248122a2d" # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 6 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 5 more similar warnings elsewhere)


  with module.backoffice.data.azurerm_key_vault_secret.bo_auth_session_secret,
  on ../_modules/backoffice/data.tf line 53, in data "azurerm_key_vault_secret" "bo_auth_session_secret":
  53: data "azurerm_key_vault_secret" "bo_auth_session_secret" {



  with module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id,
  on ../_modules/backoffice/data.tf line 58, in data "azurerm_key_vault_secret" "azure_client_secret_credential_client_id":
  58: data "azurerm_key_vault_secret" "azure_client_secret_credential_client_id" {



  with module.backoffice.data.azurerm_key_vault_secret.azure_client_secret_credential_secret,
  on ../_modules/backoffice/data.tf line 63, in data "azurerm_key_vault_secret" "azure_client_secret_credential_secret":
  63: data "azurerm_key_vault_secret" "azure_client_secret_credential_secret" {



  with module.backoffice.data.azurerm_key_vault_secret.legacy_cosmosdb_key,
  on ../_modules/backoffice/data.tf line 68, in data "azurerm_key_vault_secret" "legacy_cosmosdb_key":
  68: data "azurerm_key_vault_secret" "legacy_cosmosdb_key" {



  with module.backoffice.data.azurerm_key_vault_secret.selfcare_api_key,
  on ../_modules/backoffice/data.tf line 73, in data "azurerm_key_vault_secret" "selfcare_api_key":
  73: data "azurerm_key_vault_secret" "selfcare_api_key" {



  with module.backoffice.data.azurerm_key_vault_secret.subscription_migration_api_key,
  on ../_modules/backoffice/data.tf line 78, in data "azurerm_key_vault_secret" "subscription_migration_api_key":
  78: data "azurerm_key_vault_secret" "subscription_migration_api_key" {



  with module.cms_function_app.data.azurerm_key_vault_secret.pgres_flex_reviewer_usr_pwd,
  on ../_modules/cms_function_app/data.tf line 39, in data "azurerm_key_vault_secret" "pgres_flex_reviewer_usr_pwd":
  39: data "azurerm_key_vault_secret" "pgres_flex_reviewer_usr_pwd" {



  with module.cms_function_app.data.azurerm_key_vault_secret.jira_token,
  on ../_modules/cms_function_app/data.tf line 44, in data "azurerm_key_vault_secret" "jira_token":
  44: data "azurerm_key_vault_secret" "jira_token" {



  with module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_secret,
  on ../_modules/cms_function_app/data.tf line 49, in data "azurerm_key_vault_secret" "azure_client_secret_credential_secret":
  49: data "azurerm_key_vault_secret" "azure_client_secret_credential_secret" {



  with module.cms_function_app.data.azurerm_key_vault_secret.azure_client_secret_credential_client_id,
  on ../_modules/cms_function_app/data.tf line 54, in data "azurerm_key_vault_secret" "azure_client_secret_credential_client_id":
  54: data "azurerm_key_vault_secret" "azure_client_secret_credential_client_id" {



  with module.cms_function_app.data.azurerm_key_vault_secret.serviceid_quality_check_exclusion_list,
  on ../_modules/cms_function_app/data.tf line 59, in data "azurerm_key_vault_secret" "serviceid_quality_check_exclusion_list":
  59: data "azurerm_key_vault_secret" "serviceid_quality_check_exclusion_list" {



  with module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_connectionstring,
  on ../_modules/cms_function_app/data.tf line 65, in data "azurerm_key_vault_secret" "legacy_cosmosdb_connectionstring":
  65: data "azurerm_key_vault_secret" "legacy_cosmosdb_connectionstring" {



  with module.cms_function_app.data.azurerm_key_vault_secret.legacy_cosmosdb_key,
  on ../_modules/cms_function_app/data.tf line 70, in data "azurerm_key_vault_secret" "legacy_cosmosdb_key":
  70: data "azurerm_key_vault_secret" "legacy_cosmosdb_key" {



  with module.cms_function_app.data.azurerm_key_vault_secret.asset_storage_connectionstring_secret,
  on ../_modules/cms_function_app/data.tf line 75, in data "azurerm_key_vault_secret" "asset_storage_connectionstring_secret":
  75: data "azurerm_key_vault_secret" "asset_storage_connectionstring_secret" {



  with module.cms_function_app.data.azurerm_key_vault_secret.services_publication_event_hub_connection_string,
  on ../_modules/cms_function_app/data.tf line 81, in data "azurerm_key_vault_secret" "services_publication_event_hub_connection_string":
  81: data "azurerm_key_vault_secret" "services_publication_event_hub_connection_string" {



  with module.cms_function_app.data.azurerm_key_vault_secret.services_topics_event_hub_connection_string,
  on ../_modules/cms_function_app/data.tf line 87, in data "azurerm_key_vault_secret" "services_topics_event_hub_connection_string":
  87: data "azurerm_key_vault_secret" "services_topics_event_hub_connection_string" {



  with module.cms_function_app.data.azurerm_key_vault_secret.services_lifecycle_event_hub_connection_string,
  on ../_modules/cms_function_app/data.tf line 92, in data "azurerm_key_vault_secret" "services_lifecycle_event_hub_connection_string":
  92: data "azurerm_key_vault_secret" "services_lifecycle_event_hub_connection_string" {



  with module.cms_function_app.data.azurerm_key_vault_secret.services_history_event_hub_connection_string,
  on ../_modules/cms_function_app/data.tf line 97, in data "azurerm_key_vault_secret" "services_history_event_hub_connection_string":
  97: data "azurerm_key_vault_secret" "services_history_event_hub_connection_string" {



  with module.cms_function_app.data.azurerm_key_vault_secret.eh_sc_connectionstring,
  on ../_modules/cms_function_app/data.tf line 102, in data "azurerm_key_vault_secret" "eh_sc_connectionstring":
 102: data "azurerm_key_vault_secret" "eh_sc_connectionstring" {



  with module.key_vault.azurerm_key_vault_secret.bo_auth_session_secret,
  on ../_modules/key_vault/secrets.tf line 10, in resource "azurerm_key_vault_secret" "bo_auth_session_secret":
  10: resource "azurerm_key_vault_secret" "bo_auth_session_secret" {

::error::Terraform exited with code 1.
```

</details>
